Show / Hide Table of Contents
Class ConcreteCheckResultOverall
Concrete check result
Inheritance
System.Object
ConcreteCheckResultOverall
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteCheckResultOverall
Constructors
Improve this Doc   View Source
ConcreteCheckResultOverall()
Constructor
Declaration
public ConcreteCheckResultOverall()
Properties
Improve this Doc   View Source
Checks
All check by the type
Declaration
public List<ConcreteCheckResultOverallItem> Checks { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConcreteCheckResultOverallItem>
 Improve this Doc
 View Source